# Operations

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
df['col2'].nunique() #number of unique elements

3

In [5]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

### Selecting data

In [6]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [7]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying functions

In [8]:
def times2(x):
    return x*2

In [9]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
df['col1'].sum()

10

In [12]:
#Permanently removing a coulumn
del df['col1']

In [13]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [17]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [18]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.drop('col2', axis =1 )

  col3
0  abc
1  def
2  ghi
3  xyz

In [23]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [24]:
df.isnull() #Find Null Values or Check for Null Values

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [26]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### filling the null values in the df

In [30]:
import pandas as pd
import numpy as np

In [31]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [32]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [34]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [35]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [36]:
df.pivot_table(values='D',index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN